In [1]:
import pandas as pd
import numpy as np

In [2]:
names=['lion','cat','dog','elephant','tiger']

In [3]:
pd.Series(names)

0        lion
1         cat
2         dog
3    elephant
4       tiger
dtype: object

In [4]:
pd.Series(names,index=(1,2,3,4,5))

1        lion
2         cat
3         dog
4    elephant
5       tiger
dtype: object

In [5]:
s=pd.Series(names,index=[3,'Animal',1,4,5])
s

3             lion
Animal         cat
1              dog
4         elephant
5            tiger
dtype: object

In [6]:
s.index

Index([3, 'Animal', 1, 4, 5], dtype='object')

In [7]:
s=pd.Series(['tiger','elephant','cat','giraffe','dog'])
s

0       tiger
1    elephant
2         cat
3     giraffe
4         dog
dtype: object

In [8]:
s[0]

'tiger'

In [9]:
s.drop(0)

1    elephant
2         cat
3     giraffe
4         dog
dtype: object

In [10]:
data={
    'name':['abc','def','xyz'],
    'branch':['cse','it','ece']
}
data

{'name': ['abc', 'def', 'xyz'], 'branch': ['cse', 'it', 'ece']}

In [11]:
df=pd.DataFrame(data)
df

  name branch
0  abc    cse
1  def     it
2  xyz    ece

In [12]:
df['marks']=['100',np.nan,'70']
df

  name branch marks
0  abc    cse   100
1  def     it   NaN
2  xyz    ece    70

In [13]:
df.isnull()

    name  branch  marks
0  False   False  False
1  False   False   True
2  False   False  False

In [14]:
df

  name branch marks
0  abc    cse   100
1  def     it   NaN
2  xyz    ece    70

name      abc
branch    cse
marks     100
Name: 0, dtype: object

In [16]:
df.iloc[1:,1:]

  branch marks
1     it   NaN
2    ece    70

In [17]:
df.dropna()

  name branch marks
0  abc    cse   100
2  xyz    ece    70

In [ ]:
df.drop('marks',axis=1)  ## deleting column axis=1
                              ## axis=0 for row

In [18]:
df=pd.DataFrame([
        [np.nan,1,np.nan,2],
        [3,4,np.nan,2],
        [5,np.nan,6,np.nan]],
        columns=list('ABCD')
)
df

     A    B    C    D
0  NaN  1.0  NaN  2.0
1  3.0  4.0  NaN  2.0
2  5.0  NaN  6.0  NaN

In [ ]:
values={'A':0,'B':1,'C':2,'D':3}
df.fillna(values)

In [19]:
df.ffill()  ## forward fill

     A    B    C    D
0  NaN  1.0  NaN  2.0
1  3.0  4.0  NaN  2.0
2  5.0  4.0  6.0  2.0

In [20]:
df.bfill()  ## backward fill

     A    B    C    D
0  3.0  1.0  6.0  2.0
1  3.0  4.0  6.0  2.0
2  5.0  NaN  6.0  NaN

In [22]:
df.fillna('value',limit=2)

       A      B      C      D
0  value      1  value      2
1      3      4  value      2
2      5  value      6  value

In [ ]:
df.fillna(value=values,limit=1)

In [23]:
import pandas as pd
data={
    'name':['abc','def','xyz'],
    'branch':['cse','it','ece']
}
df=pd.DataFrame(data)
df

  name branch
0  abc    cse
1  def     it
2  xyz    ece

In [26]:
data1={
    'name':['abc','ghi','pqr'],
    'marks':[100,76,85]
}
df1=pd.DataFrame(data1)
df1

  name  marks
0  abc    100
1  ghi     76
2  pqr     85

In [ ]:
pd.merge(df,df1,on='name')

In [27]:
pd.merge(df,df1,left_on='name',right_on='name',how='outer')

  name branch  marks
0  abc    cse  100.0
1  def     it    NaN
2  xyz    ece    NaN
3  ghi    NaN   76.0
4  pqr    NaN   85.0

In [ ]:
pd.merge(df,df1,on='name',how='outer')

In [ ]:
pd.merge(df,df1,on='name',how='inner')

In [28]:
pd.merge(df,df1,on='name',how='left')

  name branch  marks
0  abc    cse  100.0
1  def     it    NaN
2  xyz    ece    NaN

In [ ]:
pd.merge(df,df1,on='name',how='right')

In [34]:
data={
    'name':['abc','def','xyz'],
    'branch':['cse','it','ece'],
    'marks':['100',np.nan,'70']
}
df=pd.DataFrame(data)
df

  name branch marks
0  abc    cse   100
1  def     it   NaN
2  xyz    ece    70

In [35]:
df.sample(2)  ## generates random rows

  name branch marks
2  xyz    ece    70
0  abc    cse   100

In [49]:
df.sort_values?

In [48]:
df.sort_values(by='marks')

  name branch marks
0  abc    cse   100
2  xyz    ece    70
1  def     it   NaN

In [ ]:
df['location']=['vzm','vizag','sklm']
df

In [ ]:
name=list(df.columns)
print(name)
name.remove('location')
name.insert(2,'location')
df[name]

In [50]:
df

  name branch marks
0  abc    cse   100
1  def     it   NaN
2  xyz    ece    70

In [ ]:
df.to_csv ("result.csv")  ## saving of data in file

In [51]:
df

  name branch marks
0  abc    cse   100
1  def     it   NaN
2  xyz    ece    70

In [52]:
for group,frame in df.groupby('name'):
    print(group,frame['marks'].sum())

abc 100
def 0
xyz 70

In [53]:
df['name'].unique()

array(['abc', 'def', 'xyz'], dtype=object)

In [54]:
df['name'].value_counts()

def    1
xyz    1
abc    1
Name: name, dtype: int64

In [55]:
students={
    'name':['sairam','neeha','mouni'],
    'eng':[82,78,90],
    'maths':[90,100,85]
}
df=pd.DataFrame(students)
df

     name  eng  maths
0  sairam   82     90
1   neeha   78    100
2   mouni   90     85

In [56]:
df['total']=df['eng']+df['maths']
df

     name  eng  maths  total
0  sairam   82     90    172
1   neeha   78    100    178
2   mouni   90     85    175

# Apply method

In [57]:
df.apply(lambda x:x.sum())

name     sairamneehamouni
eng                   250
maths                 275
total                 525
dtype: object

In [58]:
df.iloc[:,1::2].apply(lambda x:x.sum(),axis=1)

0    254
1    256
2    265
dtype: int64

In [59]:
df.apply(lambda row:sum(list(filter(lambda y:str(y).isdigit(),row.values))),axis=1)

0    344
1    356
2    350
dtype: int64